import { HostListener, Injectable } from '@angular/core';
import { SoundService } from '../sound/sound.service';
interface test{
  name:string,
  a:HTMLAudioElement
}

@Injectable({
  providedIn: 'root'
})
export class KeyService {

  
  constructor(private sound:SoundService) { }

  speech(key: string) {
    if (arrayText[key]) {
      this.tts(key)
    }
  }

  // audio = new Audio();
  tts(filename: string) {
    this.sound.getSoundThai().get(filename)?.play()
  }


}
const arrayText: any = {
  "ก": 'ก',
  "ข": 'ข',
  "ฃ": 'ฃ',
  "ค": 'ค',
  "ฅ": 'ฅ',
  "ฆ": 'ฆ',
  "ง": 'ง',
  "จ": 'ง',
  "ฉ": 'ง',
  "ช": 'ง',
  "ซ": 'ง',
  "ฌ": 'ง',
  "ญ": 'ง',
  "ฎ": 'ง',
  "ฏ": 'ง',
  "ฐ": 'ง',
  "ฑ": 'ง',
  "ฒ": 'ง',
  "ณ": 'ง',
  "ด": 'ง',
  "ต": 'ง',
  "ถ": 'ง',
  "ท": 'ง',
  "ธ": 'ง',
  "น": 'ง',
  "บ": 'ง',
  "ป": 'ง',
  "ผ": 'ง',
  "ฝ": 'ง',
  "พ": 'ง',
  "ฟ": 'ง',
  "ภ": 'ง',
  "ม": 'ง',
  "ย": 'ง',
  "ร": 'ง',
  "ล": 'ง',
  "ว": 'ง',
  "ศ": 'ง',
  "ษ": 'ง',
  "ส": 'ง',
  "ห": 'ง',
  "ฬ": 'ง',
  "อ": 'ง',
  "ฮ": 'ง',
  "ะ": 'ง',
  "า": 'ง',
  " ิ": 'ง',//ไฟล์พิเศษ
  " ี": 'ง',//ไฟล์พิเศษ
  " ึ": 'ง',//ไฟล์พิเศษ
  " ื": 'ง',//ไฟล์พิเศษ
  " ุ": 'ง',//ไฟล์พิเศษ
  " ู": 'ง',//ไฟล์พิเศษ
  "เ": 'ง',
  "แ": 'ง',
  "โ": 'ง',
}

const array: string[] = [
  "ก",
  "ข",
  "ฃ",
  "ค",
  "ฅ",
  "ฆ",
  "ง",
  "จ",
  "ฉ",
  "ช",
  "ซ",
  "ฌ",
  "ญ",
  "ฎ",
  "ฏ",
  "ฐ",
  "ฑ",
  "ฒ",
  "ณ",
  "ด",
  "ต",
  "ถ",
  "ท",
  "ธ",
  "น",
  "บ",
  "ป",
  "ผ",
  "ฝ",
  "พ",
  "ฟ",
  "ภ",
  "ม",
  "ย",
  "ร",
  "ล",
  "ว",
  "ศ",
  "ษ",
  "ส",
  "ห",
  "ฬ",
  "อ",
  "ฮ",
  "ะ",
  "า",
  " ิ",
  " ี",
  " ึ",
  " ื",
  " ุ",
  " ู",
  "เ",
  "แ",
  "โ"
]



//   ่  ้  ๊  ๋
//   ั
//   ็   ์
//  ๆ ฯ
//  ฦ ฤ